20220618121639-best_practices_for_programming.org
:PROPERTIES:
:ID:       d2494e49-8840-4773-8783-6cd586ded217
:END:
#+title: best-practices-for-programming
# TODO use mike's feedback, cite relevant papers.
I made this for a friend who is a novice programmer and needs to write
code for his thesis. I do think that every programmer needs to be reminded
of these things every now and then.

* Best practices for Programming
  :PROPERTIES:
  :CUSTOM_ID: best-practices-for-programming
  :END:

I'm a firm believer that the best practices common in software
engineering are important for any kind of programming. Even small
programs can benefit from these practices in a simple form. There are a
lot of different opinions about the specifics and starategies involved,
but the principles themselves are not controversial in software
engineering circles. If there is one overarching theme here it is: be
kind to whoever works with your code, /which includes your future self/.
# yup; exactly! Programming is a lot of delayed gratification: effort
now for clean, simple code saves a lot more effort next week, or even
tomorrow. It's fine for your discipline to slip: there will be a lot of
times you don't see the point in applying these principles.
# yes; make sure ppl aren't hard on themselves, I usually say "in a perfect world" I do all the below, but world isn't perfect - once can refine the descipline over time, depending on the use case
If you don't understand
why the principle should be used in your case; skip it rather than
applying it blindly.
# or ask for clarification
You will probably see that not following the principle backfires; but next time you will know
/why/, and apply the principle intentionally.

I should note that by far the best way to learn these things is from
working alongside someone. It's difficult to see at first how these
ideas apply to your own case. I would be happy to help you out with your
code and explain how these apply, if you would like.

I'll give a quick overview here, the rest of the document is expanding
on each of these points. Don't be overwhelmed by the details in the
rest: applying the basic principles to some extent helps plenty already.
# I'd mention not being too hard on oneself; programming well is hard, but can be learned, and doing is the best (only?) way to learn
If you're struggling, don't worry about it; applying these practices well
is really difficult, and the only way to get good at it is to learn by doing.
As a magical cartoon dog once said: "Sucking at something is the first step
 towards being kinda good at something".

** Practices to follow:
   :PROPERTIES:
   :CUSTOM_ID: practices-to-follow
   :END:

These practices help both to ensure the quality of the code you are
working on, but also to improve your skill over time.

1. Version control: use software like git to track your changes and
   store different versions of your code
   # commit early, commit often - need to get over the mindset that code needs to be perfect before 'checking in'; better to have the false starts, in some cases
   # also, I don't think people starting off know how much code is thrown away by 'senior' ppl; probably at least 1/3 of what I type is deleted at some point, better ways of doing things come up
    # new ideas, more clear versions, etc
2. Code review: have others give you feedback on your code if possible,
   return to your code to reflect on it yourself if not
3. Automated testing: write automated tests of your code (at least the
   most complex and/or important parts), and run these each time you
   make changes to verify you didn't accidentally break something.
   # thank you!
4. Abstraction and specification: for each piece of your program, define
   specifically /what/ it should do (inputs, outputs, usage) before you
   worry about /how/ it should do it. If you are not sure, there are certain
   techniques that can help give you a clearer picture.
   # specification is hard ahead of time, and getting bogged down in the details can be discouraging; often I find that writing some inital trial version, writing some tests,
   # and then trying to specify things works best - but that's my personal workflow

Version control and code review can be easily combined by using a
repository hosting tool like github, which lets you upload your version
history and contains tools for reviewing the changes made. Automated
testing and abstraction and specification can be combined by using a
Test-driven development workflow: where tests are written first, and
satisfied afterwards by implementing.

** Principles
   :PROPERTIES:
   :CUSTOM_ID: principles
   :END:

rules of thumb to watch out for when writing, reviewing, or refactoring
code. This is very much non-exhaustive, but they're the ones that seem
to crop up the most early on.
None are hard and fast rules, and occaisionally you will have to choose
between them.
# I'd make it clear that these are not hard and fast

1. DRY: don't repeat yourself
   # this is a funny one; there's a tradeoff w/ SRP & KISS; sometimes there is a bunch of overlap in a function w/ another function, but adding flags to unify them into a single function makes things
   # brittle more long term
2. SRP: single responsiblity principle, each piece of code should have a
   single, well-defined task
3. use a consistent style: enforce consistency to improve readability
   # worth recommending linters / code formatters, imo: once you get used to the 'style' (which will prob. be distasteful at first), it takes a load off ones mind
4. approximate natural language: the closer your code resembles natural
   language, the easier it is to read
5. Premature optimization is the root of all evil: write your program in
   simple form before worrying about performance.
6. KISS: keep it simple stupid

* Practices
  :PROPERTIES:
  :CUSTOM_ID: practices
  :END:

Concrete actions that promote writing good code and improving
programming skill.

