20220618121639-best_practices_for_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-17 So 10:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>best-practices-for-programming</title>
<meta name="author" content="Hugs" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">best-practices-for-programming</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#best-practices-for-programming">Best practices for Programming</a>
<ul>
<li><a href="#practices-to-follow">Practices to follow:</a></li>
<li><a href="#principles">Principles</a></li>
</ul>
</li>
<li><a href="#practices">Practices</a>
<ul>
<li><a href="#version-control">Version control</a></li>
<li><a href="#code-review">Code Review</a></li>
<li><a href="#automated-testing">Automated testing</a></li>
<li><a href="#abstraction-and-specification">Abstraction and Specification</a></li>
</ul>
</li>
<li><a href="#an-example-of-a-software-workflow">An example of a software workflow</a>
<ul>
<li><a href="#prototyping">prototyping</a></li>
</ul>
</li>
<li><a href="#principles-1">Principles</a>
<ul>
<li><a href="#dont-repeat-yourself">Don't Repeat Yourself</a></li>
<li><a href="#single-responsibility-principle">Single Responsibility Principle</a></li>
<li><a href="#use-a-consistent-style">Use a consistent style</a></li>
<li><a href="#approximate-natural-language">Approximate Natural Language</a></li>
<li><a href="#premature-optimization-is-the-root-of-all-evil">Premature optimization is the root of all evil</a></li>
<li><a href="#keep-it-simple-stupid">Keep it simple, stupid</a></li>
<li><a href="#honorable-mention-modularity">Honorable mention: modularity</a></li>
</ul>
</li>
<li><a href="#misconceptions">Misconceptions?</a>
<ul>
<li><a href="#commenting-code">Commenting code</a></li>
</ul>
</li>
<li><a href="#orgbdbd19b">acknowledgement</a></li>
</ul>
</div>
</div>
<p>
I made this for a friend who is a novice programmer and needs to write
code for his thesis. I do think that every programmer needs to be reminded
of these things every now and then.
</p>

<div id="outline-container-best-practices-for-programming" class="outline-2">
<h2 id="best-practices-for-programming">Best practices for Programming</h2>
<div class="outline-text-2" id="text-best-practices-for-programming">
<p>
I'm a firm believer that the best practices common in software
engineering are important for any kind of programming. Even small
programs can benefit from these practices in a simple form. There are a
lot of different opinions about the specifics and starategies involved,
but the principles themselves are not controversial in software
engineering circles. If there is one overarching theme here it is: be
kind to whoever works with your code, <i>which includes your future self</i>.
</p>

<p>
Programming is a lot of delayed gratification: effort
now for clean, simple code saves a lot more effort next week, or even
tomorrow. It's fine for your discipline to slip: there will be a lot of
times you don't see the point in applying these principles.
</p>

<p>
If you don't understand
why the principle should be used in your case; skip it rather than
applying it blindly.
</p>

<p>
You will probably see that not following the principle backfires; but next time you will know
<i>why</i>, and apply the principle intentionally.
</p>

<p>
I should note that by far the best way to learn these things is from
working alongside someone. It's difficult to see at first how these
ideas apply to your own case. 
</p>

<p>
I'll give a quick overview here, the rest of the document is expanding
on each of these points. Don't be overwhelmed by the details in the
rest: applying the basic principles to some extent helps plenty already.
</p>

<p>
If you're struggling, don't worry about it; applying these practices well
is really difficult, and the only way to get good at it is to learn by doing.
As a magical cartoon dog once said: "Sucking at something is the first step
 towards being kinda good at something".
</p>
</div>

<div id="outline-container-practices-to-follow" class="outline-3">
<h3 id="practices-to-follow">Practices to follow:</h3>
<div class="outline-text-3" id="text-practices-to-follow">
<p>
These practices help both to ensure the quality of the code you are
working on, but also to improve your skill over time.
</p>

<ol class="org-ol">
<li>Version control: use software like git to track your changes and
store different versions of your code.</li>
<li>Code review: have others give you feedback on your code if possible,
return to your code to reflect on it yourself if not</li>
<li>Automated testing: write automated tests of your code (at least the
most complex and/or important parts), and run these each time you
make changes to verify you didn't accidentally break something.</li>
<li>Abstraction and specification: for each piece of your program, define
specifically <i>what</i> it should do (inputs, outputs, usage) before you
worry about <i>how</i> it should do it. If you are not sure, there are certain
techniques that can help give you a clearer picture.
TODO: rephrase this, change the emphasis</li>
</ol>

<p>
Version control and code review can be easily combined by using a
repository hosting tool like github, which lets you upload your version
history and contains tools for reviewing the changes made. Automated
testing and abstraction and specification can be combined by using a
Test-driven development workflow: where tests are written first, and
satisfied afterwards by implementing.
</p>
</div>
</div>

<div id="outline-container-principles" class="outline-3">
<h3 id="principles">Principles</h3>
<div class="outline-text-3" id="text-principles">
<p>
rules of thumb to watch out for when writing, reviewing, or refactoring
code. This is very much non-exhaustive, but they're the ones that seem
to crop up the most early on.
None are hard and fast rules, and occaisionally you will have to choose
between them.
</p>

<ol class="org-ol">
<li>DRY: don't repeat yourself</li>
<li>SRP: single responsiblity principle, each piece of code should have a
single, well-defined task</li>
<li>use a consistent style: enforce consistency to improve readability</li>
<li>approximate natural language: the closer your code resembles natural
language, the easier it is to read</li>
<li>Premature optimization is the root of all evil: write your program in
simple form before worrying about performance.</li>
<li>KISS: keep it simple stupid</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-practices" class="outline-2">
<h2 id="practices">Practices</h2>
<div class="outline-text-2" id="text-practices">
<p>
Concrete actions that promote writing good code and improving
programming skill.
</p>
</div>
