20220618121639-best_practices_for_programming.html

<div id="outline-container-version-control" class="outline-3">
<h3 id="version-control">Version control</h3>
<div class="outline-text-3" id="text-version-control">
<p>
If you're already using version control, this may seem banal; but I've
worked with computer science graduates who simply chucked previous
versions into a folder called OLD. The main reason for using version
control is to ensure that when you make a change which breaks something,
you can always go back to a previous version. It is important in this
case to save a new version often. Used properly, version control
software offers a variety of other benefits too: including documenting
the changes made and integrating with other practices here. It lets you
safely explore different ways of doing things, different changes and
features without fear of mucking up the rest - and stores the result in
a findable way in case you choose to use it after all.
</p>

<p>
The most commonly used version control software is Git.
It is tricky software to understand, but fortunately you don't need
to undestand it very deeply to use it.
A few of its main features and a willingness to google will suffice.
</p>

<p>
There are plenty of tutorials
on the basic commands, but they often leave out the structure of git
workflows - which most people are taught informally by experience
working in teams. Git is structured in branches: each branch is a string
of versions. You have a main branch (usually called 'master'). The most
conventional workflow is to identify a specific change you want to make
to the code, create a new branch named for that change, work on that
branch until the change is done (may be only one extra version, may be
many), then if you decide to add that change to the code permanently you
merge the branch into master. In general, the only edits you make to the
code on each branch are those strictly relevant to the change you are
making. This ensures that it is easy to find the location of particular
modifications when you go back, and prevents you interfering with work
that may be ongoing in other branches. Each new version should be
dedicated to a specific and nameable change (commits should be
'atomic'). This means that the changelog will accurately reflect what is
changed where, and that you always know which point to go back to when
something breaks.
You can view the changes made using the commands 'git log' or 'git reflog show',
</p>

<p>
For complex changes you'll often recurse: you might make a branch for a
feature 'generate-bananas' and then branch off that for
'calculate-curvature', merge 'calculate-curvature' into
'generate-bananas' and then do the same for 'create-skin' before merging
'generate-bananas' back into master.
</p>
</div>
</div>

<div id="outline-container-code-review" class="outline-3">
<h3 id="code-review">Code Review</h3>
<div class="outline-text-3" id="text-code-review">
<p>
Code review is arguably the most important on this list: because beyond
improving the quality of your code, it also makes a really big
difference to improving your programming skill and how you apply the
other principles. Reviewing other people's code is also really helpful
for improving your own code. In a team, code review is usually done with
a git workflow, at the points where changes are merged: in order to
merge into master, colleagues need to review the changes on your branch
and approve them. People learn about new libraries, conventions,
readability, and language features through review, and since you act on
the feedback in the review by implementing it in your own code it
actually sticks in your memory more than if you read about it somwhere.
The general rule of thumb is three pairs of eyes on each line of code.
Code review usually takes the form of the reviewer reading over the
changes, noting issues and suggesting modifications, which the one who
made the changes then either implements or discusses. This may go for a
few rounds, early on it takes a lot of time because there is a lot to
improve, but before long it is less of an issue. Sometimes you may spot
an issue, but not have a clear idea of a solution. In this case, it is
important to still note it down. Someone else may have a solution, or an
idea will come to you later.
</p>

<p>
There is no real replacement for engaging in code review with other
experienced programmers, but when working solo you can still get some of
the benefits by self-review. After writing changes, give it some time
(maybe just sleep on it, maybe come back to it next week), and then
review them, edit, and merge.
</p>

<p>
Contributing to open source software can be a good way to get practice
with code review, as well as seeing some of the other practices here in
action.
</p>

<p>
It's unfortunate that this practice depends to some degree on the
environment around you to work. Part of my motivation to become a
professor is to establish a convention of code review between scientists
in a lab: because it is really very important for ones growth as a
programmer and the quality of ones output. There is also an aspect of
scientific integrity to this: peer review usually does not include
review of the code used for a study, even in computational fields. This
is, in the most technical terms, bonkers.
</p>

<p>
The code is as important as any derivation,
and it also provides the most precise picture of what was done for the
study (there have been several studies that did not make sense to me
until I read the code, others where unaddressed assumptions were hidden
in the code which should have been acknowledged in the paper).
</p>

<p>
If you have colleagues who are doing similar work in the same language,
consider suggesting mutually reviewing one another's code using
something like github, gitlab, or bitbucket (I'll expand on this in a
later section).
</p>
</div>
</div>
