20220618121639-best_practices_for_programming.org
** Automated testing
   :PROPERTIES:
   :CUSTOM_ID: automated-testing
   :END:

There is a lot of controversy about which kind of automated testing one
should do at which times: Unit testing (testing individual bits of
code), integration testing (testing that different bits of code work
well together), acceptance testing (testing that the behavior of the
application as a whole satisfies requirements), implementation testing
(testing for implementation-specific bugs and edge cases), test-then
code, or code-then-test? There is no controversy about whether or not
you should perform automated testing. You should do so in at least some
form. It's important to write tests not just to see that your code is
working now for the particular case you're concerned about (that could
be accomplished with manual testing, after all): but that changes you
make now don't break functionality you implemented previously.
The best part of this is that with your tests in place you can go back
to refactor and improve old code without fear of breaking anything.
I can straight up feel the difference in stress levels when refactoring
tested v.s. untested code.
# cannot stress this enough; perhaps name the benefits; being able to fearlessly refactor code once you've decided to change it is a superpower
It is
also a good idea to write tests reproducing any bugs you run into, to
check that you don't reintroduce them down the line (which happens way
more often than you would ever expect). The chapter on testing from
'Abstraction and specification in program development' by Barbara Liskov
provides a really useful overview of the most important elements of
testing, though it is focused on unit testing. Each language will have
frameworks for writing and running automated tests: for python I
personally really like pytest. I haven't used R in a long time, but when
I started looking I found this page:
https://www.r-bloggers.com/2019/11/automated-testing-with-testthat-in-practice/

Depending on how you do it, testing can also help improve the design of
your program. Code that is easy to test is often easy to use as well.
I like to write tests upfront to specify what the code should do
before I write the code itself: speaking of...

** Abstraction and Specification
   :PROPERTIES:
   :CUSTOM_ID: abstraction-and-specification
   :END:

When designing a piece of code - whether we're talking a single
function, a class, a module, a script or the complete software, the
design should be independent of the implementation. The point here is
that you need to define in specific terms what your piece of code needs
to do before you think about how it will do it. This is the premise for
"Abstraction and Specification in program development", mentioned in
"Smalltalk, objects, and design", and the subject of an extended rant
called "The Inmates Are Running the Asylum: Why High Tech Products Drive
Us Crazy and How to Restore the Sanity" by Alan Cooper. Though Alan
controversially states that engineers should have no influence over a
program's design (which should be left to specialized designers), the
principles he mentions crop up time and again at a more fine-grained
level in software engineering. A phrase of his that I like is: Pretend
its magic. Before you write any code, pretend your code is magic and
specify what you would like it to do. Once you implement the design it
may turn out to be infeasible, and at this point you revise your design.
Doing this the other way around: implementing first and then designing
around whatever program you made, almost always results in programs
which are awkward to use, and counterintuitively, overcomplicated.
The great thing about upfront specification is that it forces you
to ignore the changeable implementation details of your code.
This way, the usage you define for this piece of code is less likely
to need to change if the implementation changes (e.g.
if you refactor to make it more efficient).
This prevents changes to one piece of code from ballooning out into
the code which uses that piece.
If the usage of this unit of code changes when you change it's implementation,
you then also have to change every line of code which makes use of the unit.

It is often difficult to know upfront what exactly you would like
your piece of code to do. One strategy to make this easier is to write
a simple prototype of the code in question and examine its usage critically.
This can give you an idea of what you would like the program to do;
you can then throw away the prototype (discarding code is normal and often good),
and start over with a well-defined idea.
Another thing which helps is to break down the usage into individual, specific scenarios.
I'll get into a specific strategy for implementing this in the next section.
# there is likely more iteration to the above workflow that is required to make it practical, I think; you touch on it w/ prototyping below

* An example of a software workflow
  :PROPERTIES:
  :CUSTOM_ID: an-example-of-a-software-workflow
  :END:

My first programming instructor, Breanndan, was actually very good in
that he taught most of these practices early on and emphasized their
importance and universality. It's a shame that no one after him did -
because that led to me disregarding them and losing a lot of time to
obscure bugs and confusing variable names. I'll share my own strategy
for implementing the above practices in a straightforward way: mostly
based on the strategy Breanndan taught. It combines Test-driven
development and continuous integration (both popular in Agile
workplaces).

Test-driven development:

1. write/modify a function signature and a docstring describing what
   the function does
2. write a single test case for the function
3. write the simplest code needed to pass the test case
4. refactor the function as needed and repeat

This low-level process combines practices 3 and 4 into one: after an
informal specification of the function (docstring), the tests act to
formally specify its behavior.

You put this in a git workflow using a repository host (such as GitHub,
Gitlab, bitbucket, or gerrit). You'll need to set up continuous
integration to run your automated tests, and linting (enforces
consistent style; for python I run pylint, pycodestyle, and pydocstyle).

1.  you are on the master branch; pull from the remote repository to
    ensure it is up to date
2.  identify the feature you want to implement and create a branch named
    for that feature
3.  code until that feature is tested and implemented
4.  check that your tests pass and address any errors provided by
    linting software or your IDE
5.  push the feature branch to the remote repository
6.  on your repository hosting software, create a pull request :
    requesting to merge the feature branch into master
7.  resolve any merge conflicts (changes on your branch that contradict
    changes to master that occured after you branched off).
8.  address any failing tests or linting errors
9.  someone uses the repository host's built-in code review tools to
    leave comments
10. respond to comments and implement suggestions
11. repeat 7-9 until reviewer is satisfied and merge

This combines the version control and code review. By combining this
with the test-driven development you follow all four practices in a
structured and documented way. By breaking down the functionality of
your program into individual features, those features into functions,
those functions into test cases, you simplify the development process.

