20220618121639-best_practices_for_programming.html

<div id="outline-container-prototyping" class="outline-3">
<h3 id="prototyping">prototyping</h3>
<div class="outline-text-3" id="text-prototyping">
<p>
Sometimes you don't have a clear picture yet of what you want your
program to do or what its usage is, or sometimes you want some
preliminary results before investing effort into a full program. In
these cases, you may want to make a prototype, and then rewrite it from
scratch when you have a clearer idea of what you want it to do.
</p>

<p>
When prototyping, the prototype will probably be a little more
complicated than you anticipate, so it is still good to follow these
principles to an extent; but you can usually skip exhaustive unit
testing (just test the main behaviors of the program and the most
complex bits), self-review will probably suffice, and your version
history can be a straight line. You'll have to intuit based on the
circumstances to which extent to apply these practices, but it should
always be nonzero, and it is better to err on the side of clean
code that takes you twice as long as it needed to, than the stressful
nightmare of bad code which takes between 0.75 and 300 times as long as
it needed to.
</p>

<p>
Avoid building on a prototype: rewrite it rigorously first. The
shortcuts taken early on will cost far more time later than the time it
takes to rewrite.
</p>

<p>
And sometimes, you accidentally make a messy prototype while trying to
make the real deal. Sometimes, it is worthwhile to restart with lessons
learned even if you weren't intending to at first. (saved me a lot of
headache on my masters thesis).
</p>
</div>
</div>
</div>

<div id="outline-container-principles-1" class="outline-2">
<h2 id="principles-1">Principles</h2>
<div class="outline-text-2" id="text-principles-1">
<p>
General principles to keep in mind when writing, reviewing, or editing
code. Violations of these principles are sometimes necessary, but always
 worth noting and addressing if possible. There are many more
than this, listing them all would be overwhelming: these are the most
basic and important ones.
</p>
</div>

<div id="outline-container-dont-repeat-yourself" class="outline-3">
<h3 id="dont-repeat-yourself">Don't Repeat Yourself</h3>
<div class="outline-text-3" id="text-dont-repeat-yourself">
<p>
Wherever you repeat a chunk of code you have used elsewhere, this is a
sign that you should put that code into a reusable object like a function,
and use that function wherever you repeated the code.
</p>
</div>
</div>

<div id="outline-container-single-responsibility-principle" class="outline-3">
<h3 id="single-responsibility-principle">Single Responsibility Principle</h3>
<div class="outline-text-3" id="text-single-responsibility-principle">
<p>
Each piece of code (usually function, sometimes class/object or module)
should have a single, clearly defined thing it does. Avoid units with
multiple responsibilities, or responsibilities which overlap.
</p>
</div>
</div>

<div id="outline-container-use-a-consistent-style" class="outline-3">
<h3 id="use-a-consistent-style">Use a consistent style</h3>
<div class="outline-text-3" id="text-use-a-consistent-style">
<p>
Your code is easier to read when it is consistent. This includes naming
conventions, indentation, whether you put spaces before and after
operators, etc.
</p>

<p>
A common naming convention is the use nouns for variables, and verbs for
functions. A less conventional but not uncommon one uses nouns for
variables and pure functions (functions which return a value without
side effects), and verbs for functions with a side effect.
</p>

<p>
There are also programs that will help to ensure your style is consistent.
These are called linters: and will mention any style violations to you.
The first few
times you go through your code to conform to coding standards it will
probably consume a lot of time and be really annoying, but before long
you get used to coding within these standards. Most IDEs can also be
configured to warn you about style violations in real-time.
</p>
</div>
</div>

<div id="outline-container-approximate-natural-language" class="outline-3">
<h3 id="approximate-natural-language">Approximate Natural Language</h3>
<div class="outline-text-3" id="text-approximate-natural-language">
<p>
As a rule of thumb, the closer your code looks to natural language, the
easier it is to read and understand. For example, people often make the
mistake of naming variables things like: f32<sub>x</sub><sub>arr</sub>, which contains some
information about what the variable is, but not what it represents.
<code>f32_x_arr += f32_vx_arr</code> is confusing, while
<code>x_positions += x_velocities</code> can be skimmed to understand what this
means in the application domain. Another common case where this applies
is when there is some complicated set of operations that could be given
an intuitive name as a function. For example
</p>

<pre class="example" id="orgd808cf4">
for item in inventory:
    if item.nutritional_content &gt; 0 and (item.isliquid and item.viscosity &lt; 1 or item.hardness &gt; TOOTH_HARDNESS):
        self.mouth.angle += 25
        #(and so on, you get the picture)
</pre>

<p>
could be
</p>

<pre class="example" id="orgdc79707">
for item in inventory:
    if _is_edible(item):
        self.eat(item)
</pre>

<p>
by just defining some well-named functions.
</p>
</div>
</div>

<div id="outline-container-premature-optimization-is-the-root-of-all-evil" class="outline-3">
<h3 id="premature-optimization-is-the-root-of-all-evil">Premature optimization is the root of all evil</h3>
<div class="outline-text-3" id="text-premature-optimization-is-the-root-of-all-evil">
<p>
When writing code, it is easy to get sidetracked early with making it as
efficient as possible. This often results in more complicated code and a
lot of additional effort with very few performance benefits. Our
intuitiions for performance are usually not very good - and often depend
on the usage of the program. It is best not to think too much about
performance at first. Once your program is running, if it is slower than
you would like, you can use a profiler tool to empirically identify the
most important bottlenecks and refactor those specifically.
</p>
</div>
</div>

<div id="outline-container-keep-it-simple-stupid" class="outline-3">
<h3 id="keep-it-simple-stupid">Keep it simple, stupid</h3>
<div class="outline-text-3" id="text-keep-it-simple-stupid">
<p>
Less code is better than more code, and an embarassingly simple program
that gets the job done is way better than an impressively complicated
program that does the same job <i>even if the former took longer to
develop</i>. It's easier to understand, easier to improve on,
easier to prevent and spot bugs in, and just plain better for your sanity.
</p>
</div>
</div>

<div id="outline-container-honorable-mention-modularity" class="outline-3">
<h3 id="honorable-mention-modularity">Honorable mention: modularity</h3>
<div class="outline-text-3" id="text-honorable-mention-modularity">
<p>
Honorable mention because it's really a theme running through all the
other principles: your code should be broken into chunks that operate
mostly independently of one another, minimizing the risk that changes in
one chunk break a different one. Software is a diseconomy of scale: the
effort to make a program scales superlinearly with its size. By turning
one program into a collection of smaller ones, you address this scaling.
</p>
</div>
</div>
</div>

<div id="outline-container-misconceptions" class="outline-2">
<h2 id="misconceptions">Misconceptions?</h2>
<div class="outline-text-2" id="text-misconceptions">
</div>

<div id="outline-container-commenting-code" class="outline-3">
<h3 id="commenting-code">Commenting code</h3>
<div class="outline-text-3" id="text-commenting-code">
<p>
Besides docstrings (which are documentation, rather than comments),
comments should be the exception rather than the rule. It's a bit of a
meme for novices to complain about uncommented code. In general, if code
requires comments to be clear, the code is poorly written. Sometimes a
comment is needed to clarify <i>why</i> something is done a particular way,
but if a comment clarifies <i>what</i> the code does, it is a sign that code
could be written more clearly.
</p>
</div>
</div>
</div>


<div id="outline-container-orgbdbd19b" class="outline-2">
<h2 id="orgbdbd19b">acknowledgement</h2>
<div class="outline-text-2" id="text-orgbdbd19b">
<p>
I'd like to thank Mike Gvaert for his feedback on this document.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src="https://utteranc.es/client.js"
        repo="HDictus/HDictus.github.io"
        issue-term="title"
        theme="github-light"
        crossorigin="anonymous"
        async>
      </script>
</div>
</body>
</html>